/*
Доработайтепример08.15 такимобразом,чтобыпользовательмогбратьостатокотделения,возводитьвсте-
пень и вычислять абсолютное значение длинных чисел. Реализуйте в классе Integer перегруженный оператор
взятия остатка от деления с присваиванием. Реализуйте дружественный для класса Integer перегруженный
оператор взятия остатка от деления. Реализуйте дружественную для класса Integer функцию pow для возве-
дения длинного числа в целую степень типа unsigned int. Реализуйте в классе Integer публичные функции-
члены sign и abs для получения знака и вычисления абсолютного значения длинного числа соответственно.
*/

